app/Controllers/Mascota.php

SELECT *
FROM `MASCOTA`
ORDER BY `ID_MASCOTA` ASC
---
    public function list()
    {
        $mascotas = model('Mascota');
        $data ['cabezera'] = view('cabezera');
        $data ['footer'] = view('footer');
        $data ['mascota'] = $mascotas->orderBy('ID_MASCOTA', 'ASC')->findAll();

SELECT *
FROM `MASCOTA`
WHERE `ID_MASCOTA` = '1'
 LIMIT 1
---
    public function edition()
    {
        $mascotas = model('Mascota');
        $data ['cabezera'] = view('cabezera');
        $data ['footer'] = view('footer');
        $data["mascota"] = $mascotas->where('ID_MASCOTA', $_GET['ID'])->first();