app/Controllers/Servicios.php

SELECT *
FROM `SERVICIOS`
ORDER BY `ID_SERVICIOS` ASC
---
    public function list()
    {
        $services = model('Servicios');
        $data ['servicios'] = $services->orderBy('ID_SERVICIOS', 'ASC')->findAll();